#Дано список
'''
data = [1,2,31,23,213,213,123,1,1,1,21,2,3,231,2321,31,31,23,13,2,23,23,2,2321]
'''
# та
'''
data2 = [3,2,4,34,5,45,6,65,756,4,56,856,756,67,856,234,54,754,235,547,34,346,455,3,54,634,434,634,5,2345]
'''
# Задачі
# 1
'''
Позбутись дублювання у списках data і data2
'''

"""
data = set([1,2,31,23,213,213,123,1,1,1,21,2,3,231,2321,31,31,23,13,2,23,23,2,2321])
data2 = set([3,2,4,34,5,45,6,65,756,4,56,856,756,67,856,234,54,754,235,547,34,346,455,3,54,634,434,634,5,2345])
print(sorted(data.union(data2)))
"""

# 2
'''
Знайти унікальні елементи для data
Знайти унікальні елементи для data2
елементи які є у data і яких немає у data2
'''
'''
data = set([1,2,31,23,213,213,123,1,1,1,21,2,3,231,2321,31,31,23,13,2,23,23,2,2321])
data2 = set([3,2,4,34,5,45,6,65,756,4,56,856,756,67,856,234,54,754,235,547,34,346,455,3,54,634,434,634,5,2345])
data_1 = data
data2_2 = data2
print(data_1.difference(data2_2))
print(data2_2.difference(data_1))
'''

# 3
'''
знайти перетин між data і data2
сформувати із нього кортеж
'''

"""
data = set([1,2,31,23,213,213,123,1,1,1,21,2,3,231,2321,31,31,23,13,2,23,23,2,2321])
data2 = set([3,2,4,34,5,45,6,65,756,4,56,856,756,67,856,234,54,754,235,547,34,346,455,3,54,634,434,634,5,2345])
print(data.intersection(data2))
#print(data&data2)# - результат {2, 3}
"""





